<template>
    <v-layout row>
        <v-flex xs12 sm8 offset-sm2>
            <v-card>
                <v-list two-line subheader>
                    <v-subheader inset>Полимерные трубы</v-subheader>

                    <v-list-tile
                            v-for="item in items"
                            :key="item.title"
                            avatar
                            @click="back(item.title, item.dsc, item.link)"
                    >
                        <v-list-tile-avatar>
                            <img :src="item.avatar">
                        </v-list-tile-avatar>

                        <v-list-tile-content>
                            <v-list-tile-title>{{ item.title }}</v-list-tile-title>
                        </v-list-tile-content>

                    </v-list-tile>

                    <v-divider inset></v-divider>

                    <v-subheader inset>Аппарат для сварки полиэтиленовых труб</v-subheader>

                    <v-list-tile
                            v-for="item in items2"
                            :key="item.title"
                            avatar
                            @click="back(item.title, item.dsc, item.link)"
                    >
                        <v-list-tile-avatar>
                            <img :src="item.avatar">
                        </v-list-tile-avatar>

                        <v-list-tile-content>
                            <v-list-tile-title>{{ item.title }}</v-list-tile-title>
                        </v-list-tile-content>
                    </v-list-tile>
                    <v-divider inset></v-divider>

                    <v-subheader inset>Фитинги полиэтиленовые и комплектующие</v-subheader>

                    <v-list-tile
                            v-for="item in items3"
                            :key="item.title"
                            avatar
                            @click="back(item.title, item.dsc, item.link)"
                    >
                        <v-list-tile-avatar>
                            <img :src="item.avatar">
                        </v-list-tile-avatar>

                        <v-list-tile-content>
                            <v-list-tile-title>{{ item.title }}</v-list-tile-title>
                        </v-list-tile-content>
                    </v-list-tile>
                    <v-divider inset></v-divider>

                    <v-subheader inset>Запорно-регулирующая арматура</v-subheader>

                    <v-list-tile
                            v-for="item in items4"
                            :key="item.title"
                            avatar
                            @click="back(item.title, item.dsc, item.link)"
                    >
                        <v-list-tile-avatar>
                            <img :src="item.avatar">
                        </v-list-tile-avatar>

                        <v-list-tile-content>
                            <v-list-tile-title>{{ item.title }}</v-list-tile-title>
                        </v-list-tile-content>

                    </v-list-tile>
                    <v-divider inset></v-divider>

                    <v-subheader inset>Полиэтиленовые колодцы и резервуары</v-subheader>

                    <v-list-tile
                            v-for="item in items5"
                            :key="item.title"
                            avatar
                            @click="back(item.title, item.dsc, item.link)"
                    >
                        <v-list-tile-avatar>
                            <img :src="item.avatar">
                        </v-list-tile-avatar>

                        <v-list-tile-content>
                            <v-list-tile-title>{{ item.title }}</v-list-tile-title>
                        </v-list-tile-content>
                    </v-list-tile>
                </v-list>
            </v-card>
        </v-flex>
    </v-layout>
</template>

<script>
    export default {
        name: "Product",
        data () {
            return {
                items: [
                    {
                        avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_water.jpg',
                        title: 'Водоснабжение',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_gas.jpg',
                        title: 'Газоснабжение',
                        dsc:'',
                        link:'',
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar3.png',
                        title: 'Канализация',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/drenazhlogo.png',
                        title: 'Дренаж',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar4.png',
                        title: 'С защитной оболочкой PROSAFE',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar5.png',
                        title: 'Теплоснабжение',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar5.png',
                        title: 'Кабельные сети',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar17.png',
                        title: 'Напорные ПВХ',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/truba-spiral-new.png',
                        title: 'Сперальновитая техстрой СВТ',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/er11.jpg',
                        title: 'Система для релайнинга',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/TrubaMultiDex/multitehlogo.png',
                        title: 'Многослойные трубы Мультитех',
                        dsc:'',
                        link:''
                    }
                ],
                items2: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar31.png',
                        title: 'Аппараты для электромуфтовой сварки',
                        dsc:'',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar32.png',
                        title: 'Стыковые сварочные аппараты',
                        dsc:'',
                        link:''
                    }
                ],
                items3: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar131.png',
                        title: 'Сегментные фитинги ПЭ',
                        dsc:'<p><strong>Сегментные фитинги для полиэтиленовых труб</strong> применяются при проведении монтажных работ, связанных с обустройством полиэтиленовых трубопроводов различных диаметров и назначений.</p>\n' +
                        '<p>Также <strong>фитинги для полиэтиленовых труб именуются как фитинги для ПНД</strong>, что совершенно корректно, потому как производятся они из высокоплотных ПЭ-материалов низкого давления. Такие элементы могут использоваться в качестве составных частей современных трубопроводов, в системах водоснабжения частного и производственного характера.</p>\n' +
                        '<p>Благодаря своей высокой технологичности ПЭ-фитинги обеспечивают надёжное соединение в местах стыковки труб друг с другом, а также при использовании муфт, тройников, переходов, включая стыкование стального и полиэтиленового трубопроводов. Их применение позволяет решать задачи различной сложности на высоком техническом уровне, создавая трубопроводную сеть с большим эксплуатационным ресурсом.</p>\n' +
                        '<p>Фитинги мы изготавливаем по ТУ2248-004-54432486-2015 или эскизу заказчика методом стыковой сварки заготовок труб. Сварка труб методом встык — современный и малозатратный способ конструирования фасонных частей трубопроводов практически любой сложности. Сварные фитинги используются при монтаже трубопроводов, труб для канализации в местах поворотов, разветвлений, изменений диаметра трассы, присоединения трубопроводной арматуры и т. п.</p>\n' +
                        '<h3>Купить полиэтиленовые фитинги: доступная цена</h3>\n' +
                        '<p><strong>Купить фитинги для полиэтиленовых и гофрированных труб</strong> по доступным ценам можно на заводе «Техстрой». Наш <a href="/fitingi-polietilenovye-i-komplektuyushchie">каталог</a> включает в себя различные фитинговые элементы:</p>\n' +
                        '<h3>Отвод полиэтиленовый</h3>\n' +
                        '<p><strong>Отводы для полиэтиленовых труб</strong> отличаются высокой практичностью и удобством монтажа: их можно запроектировать в части трубопровода под любым углом и успешно реализовать эту задачу на практике. Это нередко позволяет решить ряд сложностей, возникающих в силу специфики технической ситуации.</p>\n' +
                        '<h3>Тройник полиэтиленовый</h3>\n' +
                        '<p><strong>Тройники для полиэтиленовых труб</strong> используются при проведении монтажных работ по обустройству трубопроводов, транспортирующих питьевую и техническую воду. Такой тройник является сварной конструкцией и производится на заводе «Техстрой». Материалом для его изготовления служит полиэтиленовая труба марки ПЭ 100, изготовленная по ТУ 2248-019-54432486-2014. ПЭ-тройник может иметь диаметр от 32 до 800 мм и рассчитан на работу в системе с давлением от 0,6 до 1,6 МПа.</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar133.png',
                        title: 'Фитинги из гофрированных труб',
                        dsc:'<p>\n' +
                        '\t\t<p>Качественные соединительные изделия для канализации и дренажных систем предлагает завод «Техстрой»! Реализуем только собственную продукцию! Звоните: 8 (800) 350-20-70, отгружаем быстро!\n' +
                        '\t\t</p>\n' +
                        '\t\t<p><strong>Соединительные детали из гофрированных полипропиленовых и полиэтиленовых труб: преимущества конструкции</strong>\n' +
                        '\t\t</p>\n' +
                        '\t\t<p>Все виды соединительных конструкций изготавливаются на заводах «Техстрой» из высокоплотного полиэтилена и полипропилена. Изделия используются для прочного соединения безнапорных систем канализации и дренажа. Плотность прилегания достигается применением специальных резиновых прокладок, поставляемых отдельно. Конструкции снабжены элементами жёсткости, как и гофрированные трубы, и обладают строением, позволяющим создать оптимальное крепление двух отрезков труб.\n' +
                        '\t\t</p>\n' +
                        '\t\t<p>Для соединения трубопроводов без раструбов применяются специальные муфты.\n' +
                        '\t\t</p>\n' +
                        '\t\t<p>Обратившись в «Техстрой», вы найдете следующие изделия:\n' +
                        '\t\t</p>\n' +
                        '\t\t<ul>\n' +
                        '\t\t\t<li>Отводы, тройники, крестовины;\n' +
                        '\t\t\t</li>\n' +
                        '\t\t\t<li>Муфты для прохода через железобетонные колодцы;\n' +
                        '\t\t\t</li>\n' +
                        '\t\t\t<li>Муфты соединительные с удобным упором, полумуфты;\n' +
                        '\t\t\t</li>\n' +
                        '\t\t\t<li>Резиновые прокладки, обеспечивающие герметичное и плотное соединение.\n' +
                        '\t\t\t</li>\n' +
                        '\t\t</ul>\n' +
                        '\t</p>',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/lityefitingilogo.png',
                        title: 'Литые фитинги',
                        dsc:'<p>Соединение труб ПНД в трубопровод, особенно требовательных к давлению в системе, невозможно представить без литых фитингов. Они изготавливаются из того же материала, что и вся остальная система, - полиэтилен.</p>\n' +
                        '<p>Литые фитинги применяются при создании:</p>\n' +
                        '<ul>\n' +
                        '<li>водопроводных систем технического и питьевого назначения;</li>\n' +
                        '<li>систем орошения;</li>\n' +
                        '<li>газопроводов.</li>\n' +
                        '</ul>\n' +
                        '<p>Фасонные изделия для полиэтиленовых труб, произведённые методом литья полиэтилена под давлением, выпускаются ООО «Техстрой» в различном диапазоне диаметров и толщины стенки, что позволяет создавать трубопровод любой направленности и разветвлённости. Литые фитинги позволяют присоединить трубопровод к стальным трубопроводам и запорной арматуре.</p>\n' +
                        '<p>Завод «Техстрой» имеет возможность укомплектовать инженерные сети соединительными деталями. Ассортимент литых фитингов – редукционные тройники, заглушки, короткие и удлинённые переходы, отводы, втулки и др., – решит задачи любой сложности. Мы предлагаем фитинги различных параметров для систем газо- и водоснабжения.</p>\n' +
                        '<p>Наши фитинги проходят входной контроль и испытания в условиях лаборатории нашего предприятия.</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar135.png',
                        title: 'Электросварные фитинги',
                        dsc:'<p>\n' +
                        '\t<p>FRIALEN®, фирма FRIATEC AG, Германия – соединительные элементы, фасонные изделия и запорная арматура с закладным нагревательным элементом, предназначенные для строительства трубопроводов из ПЭ.</span>\n' +
                        '\t</p>\n' +
                        '\t<p>Ассортимент изделий включает муфты, диаметром от 20 до 1200 мм (муфта электросварная ПЭ 100 SDR 11), фасонные изделия различных типов (отвод, муфта переходная), седловые отводы, запорную арматуру и вентили для врезки под давлением, шаровые краны из ПЭ, переходные элементы металл/ПЭ, специальные изделия для реконструкции и ремонта трубопроводов из ПЭ.</span>\n' +
                        '\t</p>\n' +
                        '\t<p>Изделия ФРИАЛЕН® отличаются высочайшими техническими характеристиками и являются эталоном по параметрам качества изготовления, надёжности и долговечности сварных соединений.</span>\n' +
                        '\t</p>\n' +
                        '\t<p>С помощью изделий ФРИАЛЕН® можно организовать газораспределительную сеть (газопровод), водоотвод, канализационную сеть и другие виды сетей, выполнить беспрецедентно надёжный монтаж газовых труб.</span>\n' +
                        '\t</p>\n' +
                        '\t<p>Теперь в номенклатуре муфты для газопроводов SDR 9 и клапан безопасности расхода газа (газ стоп). Изделия соответствуют требованиям нового СП 62.13330.2011, актуализированный СНиП 42-01.</span>\n' +
                        '\t</p>\n' +
                        '</p>',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar136.jpg',
                        title: 'Технологические заглушки',
                        dsc:'<p>ООО «Техстрой» является производителем<strong> технологических заглушек (колпаков)</strong> для полимерных трубопроводов.</p>\n' +
                        '<p><span style="text-decoration: underline;">Предназначение заглушек:</span></p>\n' +
                        '<p>а) для предотвращения повреждений торцов сварных труб малого и среднего диаметров, деталей полимерных трубопроводов при транспортировке, складировании и хранении.</p>\n' +
                        '<p>б) для обеспечения защиты от попадания вовнутрь атмосферных осадков, грязи, инородных тел.</p>\n' +
                        '<p><span style="text-decoration: underline;">Сфера применения:</span></p>\n' +
                        '<p>— производители, потребители, транспортные компании, связанные с полимерными трубами (хранение, транспортировка, экспорт). Предлагаемые заглушки производства «Техстрой» обеспечивают сохранение технических и технологических свойств при температурных режимах от – 50º С до + 80º С. Используемые полимерные материалы не содержат токсичных компонентов, веществ способных вызвать коррозию, а также слипание поверхности.</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/ncpc/ncpc-logo.png',
                        title: 'НСПС',
                        dsc:'<p>Переход полиэтилен – сталь или НСПС (Неразъёмное Соединение Полиэтилен Сталь) Используется для соединения металлических и полиэтиленовых труб. Востребованыпри замене устаревших участков металлических труб на полиэтиленовые. Применяются при монтаже водоснабжения, газоснабжения или напорной канализации. В зависимости от марки полиэтилена подразделяются на НСПС для холодных и горячих сред. Изделие представляет собой герметично соединённые в заводских условиях отрезки металлической и полиэтиленовой труб. Усиление шва обеспечивается использованием специальной муфты. Широкий ассортимент диаметров, доступность по цене, делают данное изделие незаменимым при строительстве и ремонте наружных сетей. Более подробную информацию вы можете получить при обращении к специалистам завода Техстрой.</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/tovar131.png',
                        title: 'Вытянутый тройник',
                        dsc:'<p>ООО «Техстрой» запустило производство вытянутых &nbsp;полиэтиленовых тройников из ПНД.</p>\n' +
                        '\t<p>Этот элемент представляет собой фасонную часть трубопровода с тремя присоединительными концами.</p>\n' +
                        '\t<p>Соединение фитинга с основной магистралью осуществляется сварным способом, электромуфтовым. Сварка фитинга этого вида осуществляется посредством электродиффузионного или стыкового метода.</p>\n' +
                        '\t<p>&nbsp;</p>\n' +
                        '\t<p>Тип: Вытянутый</p>\n' +
                        '\t<p>Форм-фактор: Тройник</p>\n' +
                        '\t<p>Среда: Вода</p>\n' +
                        '\t<p>Марка ПЭ: ПЭ 100</p>\n' +
                        '\t<p>Диаметр (мм.): 315*160</p>\n' +
                        '\t<p>Давление (атм.): 10</p>\n' +
                        '\t<p>SDR: 17</p>\n' +
                        '\t<p>Цена: 7 500 руб/шт</p>\n' +
                        '\t',
                        link:''
                    }
                ],
                items4: [
                    {
                        avatar: 'http://tehstroi.ru/images/tovar41.png',
                        title: 'Задвижки с обрезным клином',
                        dsc:'<p>Дизайну клиновых задвижек характерна надёжность до мельчайших деталей.\n' +
                        '\t</p>\n' +
                        '\t<p>Клин полностью вулканизирован резиной EPDM состав которой утверждён для контакта с питьевой водой. Клин имеет исключительную износостойкость благодаря свойству резины восстанавливать свою первоначальную форму, процессу обрезинивания сердечника двойной адгезией слоя и своей прочной конструкции. Надёжность системы уплотнения штока, состоящей из 4-х частей, высокая прочность штока и полная антикоррозийная защита обеспечивают непревзойдённую надёжность задвижки.\n' +
                        '\t</p>\n' +
                        '\t<p>Номенклатурный каталог компании включает в себя широкий ассортимент задвижек для газа, пожаротушении с различными способами присоединения.\n' +
                        '\t</p>\n' +
                        '\t<p>Задвижки производства Metalpol, Польша, тип 111 UG, с обрезиненным клином применяются как запорное устройство на трубопроводах для холодной и горячей воды и системах канализации. Благодаря обрезиненной конструкции клина задвижки обладают высокой герметичностью (Класс «А»). Конструкция с невыдвижным шпинделем имеет более компактные размеры, что облегчает установку чугунных задвижек с обрезиненным клином в условиях ограниченных пространств. Задвижка предназначена для закрывания и открывания потока жидкости. Могут устанавливаться в подземных и надземных трубопроводах (горизонтально и вертикально).\n' +
                        '\t</p>\n' +
                        '\t<ul>\n' +
                        '\t\t<li>Давление PN:1,0 и 1,6 МПа;\n' +
                        '\t\t</li>\n' +
                        '\t\t<li>Температура рабочей среды: от -30⁰ до +130⁰С;\n' +
                        '\t\t</li>\n' +
                        '\t\t<li>Срок службы не менее 50 лет;\n' +
                        '\t\t</li>\n' +
                        '\t\t<li>Гарантия 10 лет.\n' +
                        '\t\t</li>\n' +
                        '\t</ul>',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/1.png',
                        title: 'Ножевые/шиберные задвижки',
                        dsc:'<p>Задвижка шиберная ножевая с невыдвижным и выдвижным штоком и штурвалом, со сменным верхним сальником.</p>\n' +
                        '<p>Шиберные ножевые задвижки с фланцевым/межфланцевым присоединением являются двунаправленными с гладкостенным и полным проходом. Защищённые уплотнения и материалы высокого класса обеспечивают отличные эксплуатационные характеристики и длительный срок службы. Задвижки можно налаживать во время их работы. Варианты поставки: с рычагом, выдвижным штоком и штурвалом или с невыдвижным штоком и штурвалом, с пневматическим приводом, с фланцем ISO для установки привода или вместе с электроприводом</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/2.png',
                        title: 'Поворотно-дисковые затворы ',
                        dsc:'<p>Затвор дисковый поворотный с двойным эксцентрико-длиннымплоским диском, встроенным седлом, редуктором IP67 на фланце ISO.</p>\n' +
                        '<p>Дизайну дисковых поворотных затворов с двойным эксцентриком характерен наклонённый закреплённый диск, обеспечивающий длительный срок службы и лёгкий технический уход.</p>\n' +
                        '<p>Уплотнение седла из резины EPDM, утверждённой для контакта с питьевой водой, имеет большую упругость, что позволяет ему восстанавливать свою первоначальную форму после прижатия диском. Защитное эпоксидное покрытие. Концы вала защищены от коррозии, что даёт долговечность эксплуатации. Затвор обеспечивает возможность работы в обоих направлениях потока.</p>\n',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/3.png',
                        title: 'Клапаны и фильтры',
                        dsc:'<p>ООО «Техстрой» предлагает полный ассортимент запорной арматуры для применения в трубопроводах, транспортирующих воду и газ, а также иных потребностей. Мы сотрудничаем с импортными и отечественными производителями с разным ценовым диапазоном. На территории Республики Татарстан завод «Техстрой» является официальным дилером компании AVK INTERNATIONAL A/S, расположенной в Дании, г. Гальтен, которая производит запорную арматуру, гидранты и аксессуары для водопроводов, газопроводов, систем обработки сточных вод и противопожарной защиты.</p>\n' +
                        '<p>В номенклатуру входят клиновые задвижки, поворотные центрические дисковые затворы и затворы с двойным эксцентриком, межфланцевые затворы, шиберные задвижки, поворотные обратные и воздушные клапаны, регулирующие клапаны «после себя», гидранты, уличные лючки, соединители, ответвительные и ремонтные хомуты, фитинги и аксессуары.</p>\n' +
                        '<p>Представляем широкий выбор клапанов и фильтров для водопроводных, канализационных сетей, насосных станций, технического водоснабжения.</p>\n' +
                        '<',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/4.png',
                        title: 'Соединительная арматура',
                        dsc:'<p>Соединительная арматура</p>\n' +
                        '<p>Предлагаемый ассортимент соединительной арматуры широко используется в водопроводных и канализационных сетях, и промышленности. Номенклатурный ряд седелок для врезок подходит для труб из ПВХ, ПЭ, асбестоцемента, стали и чугуна всех номинальных диаметров вплоть до 1000 мм, а соединительные муфты и фланцевые адаптеры покрывают диаметры до 2200 мм.</p>\n' +
                        '<p>При проектировании и установке инженерного оборудования на трубопроводах использование демонтажных вставок имеет две задачи: во-первых, они незаменимы при монтаже и демонтаже оборудования, во-вторых, демонтажные вставки могут использоваться при соединении двух участков трубопроводов.</p>\n' +
                        '<',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/phocagallery/Zap-Reg-Armatura/5.png',
                        title: 'Задвижки с обрезиненным клином для газа',
                        dsc:'<p>Запорная арматура для газа включает в себя большой ассортимент изделий:</p>\n' +
                        '\t<ol start="1">\n' +
                        '\t\t<li>Задвижка клиновая полнопроходная со стальными патрубками для природного газа DN 50-600 PN 16 (в том числе с электроприводом).</li>\n' +
                        '\t\t<li>Задвижка клиновая полнопроходная с ПЭ патрубками для природного газа DN 25-400 PN 10 (в том числе с электроприводом).</li>\n' +
                        '\t\t<li>Задвижка клиновая полнопроходная фланцевая для природного газа DN 40-600 PN 10/16.</li>\n' +
                        '\t\t<li>Кран шаровый полиэтиленовый полнопроходной DN 20-150 PN 10.</li>\n' +
                        '\t\t<li>Задвижка клиновая полнопроходная с внутренней резьбой малых диаметров для природного газа DN 20-50 PN 4.</li>\n' +
                        '\t</ol>\n' +
                        '\t<p>Дизайну клиновых задвижек AVK характерна безопасность до мельчайших деталей с полной прослеживаемостью производства их основных компонентов. Клин полностью вулканизирован резиной NBR своего собственного производства AVK, резистентной к нефтегазовой среде, состав которой имеет исключительную износостойкость благодаря способности восстанавливать свою первоначальную форму после сжатия. Эти свойства резины, процесс обрезинивания сердечника двойной адгезией слоя и прочность конструкции клина обеспечивают его долговечность.</p>\n' +
                        '\t<p>Тройная система уплотнения штока, сменная под давлением, высокая прочность штока и полная антикоррозийная защита обеспечивают непревзойдённую надёжность задвижки.</p>\n',
                        link:''
                    },
                    {avatar: 'http://tehstroi.ru/images/flanci/naleclogo.png',
                        title: 'Фланцы',
                        dsc:'<p>Фланцы стальные ГОСТ 12820-80 предназначены для герметичного соединения фрагментов трубопровода, а также присоединения трубопроводной арматуры. Преимущество фланцевого соединения заключается в широких возможностях монтажа. Любое фланцевое соединение является разъёмным, что позволяет производить своевременную замену и обслуживание запорной арматуры.</p>\n' +
                        '<p>Используются при прокладке временного трубопровода, укладки трубы в подтопленных, труднодоступных местах, где использование стыковых аппаратов невозможно в связи с недостаточностью пространства, а использование электросварочного аппарата связано с опасностью короткого замыкания или невозможно в связи с отсутствием электроэнергии. Для монтажа фланцев используются специальные болты.</p>\n' +
                        '<p>Широкий ассортимент фланцев делает их незаменимым материалом для монтажа наружных сетей. Пригодны для соединения металлических труб при помощи сварки. Для полиэтиленовых труб используются расточенные фланцы под втулку необходимого диаметра. Для увеличения срока службы используются фланцы с полипропиленовым покрытием. Фланец подбирается под давление, указанное на трубе, и применяется как на газопроводе, так и трубопроводах горячего и холодного водоснабжения.</p>\n',
                        link:''
                    }
                ],
                items5: [
                    {avatar: 'http://tehstroi.ru/images/1.png',
                        title: 'Лотковые',
                        dsc:'<p>Завод «Техстрой» представляет <strong>полиэтиленовые колодцы</strong>, которые могут быть эффективно использованы в хозяйственно-бытовом сегменте, при обустройстве общесплавной и ливневой канализации. Вместе с тем <strong>полиэтиленовые канализационные колодцы</strong> нередко применяются для создания каналов, через которые планируется транспортировать отходы промышленного и технологического характера. Такие ПЭ-сооружения дают возможность просто и оперативно добраться к стоковым каналам и к элементам запорно-регулирующей арматуры, расположенным в системе. Применение колодцев возможно в различных сферах, что обусловлено гибкостью конструкции и возможностью использования большого количества рабочих элементов при их обустройстве.</p>\n' +
                        '<p>Основными преимуществами <strong>полиэтиленовых колодцев</strong> являются:</p>\n' +
                        '<ul>\n' +
                        '<li>абсолютная герметичность;</li>\n' +
                        '<li>простота в обслуживании и эксплуатации;</li>\n' +
                        '<li>безаварийная работа в течение длительного срока;</li>\n' +
                        '<li>устойчивость к процессам коррозии и различным химическим влияниям.</li>\n' +
                        '</ul>\n' +
                        '<p>В целом, такие конструкции обладают высокими эксплуатационными характеристиками.</p>\n' +
                        '<h2 style="color: #000000; background: none; margin: 0px 0px 0px 0px;">Лотковые полиэтиленовые колодцы</h2>\n' +
                        '<p>Такие изделия могут быть использованы в общесплавных, ливневых и хозяйственно-бытовых канальных системах. Тип лотка может варьироваться в зависимости от числа входов и выходов.</p>\n' +
                        '<p>Лотки бывают следующих типов:</p>\n' +
                        '<ul>\n' +
                        '<li><strong>прямопроходной</strong> – предназначен для установки на прямых участках трубопровода с периодичностью, которая определяется диаметром рабочей трубы;</li>\n' +
                        '<li><strong>угловой</strong> – предназначен для участков трубопроводов, имеющих повороты и изгибы;</li>\n' +
                        '<li><strong>тройниковый</strong> – предназначен для установки в местах разветвлений в системе трубопровода;</li>\n' +
                        '<li><strong>крестовинный</strong>.</li>\n' +
                        '</ul>',
                        link:''
                    },
                    {
                        avatar: 'http://tehstroi.ru/images/2.png',
                        title: 'Ливневый колодец (безлотковый)',
                        dsc:'<p><strong>Ливневые колодцы</strong> применяются для приёма и отведения дождевых вод. Уровень функционирования ливневой системы определяется профилем поверхности и тем, насколько качественно сделана дождеприёмная система. Каждая конкретная ситуация может различаться количеством ливневых стоков, а, соответственно, различаются и профили поверхности ливневых колодцев. <strong>Колодцы для ливневой канализации</strong> выполняют ключевую функцию во всей ливневой системе, поэтому им должно быть уделено максимальное внимание на стадии формирования проекта.</p>\n' +
                        'Чаще всего ливневая канализация, наряду с трубами и ливневыми колодцами, состоит из таких очистных конструкций, как фильтрующие патроны, масло-, бензо- и пескоотделители. На продолжительность эксплуатационного срока ливневой канализации влияет качество её исполнения, бережность в использовании, уровень защиты от загрязнения и другие факторы.</div>\n',
                        link:''
                    },
                    {avatar: 'http://tehstroi.ru/images/4.png',
                        title: 'Резервуары для хранения питьевой воды ',
                        dsc:'<p><strong>Резервуары для чистой питьевой воды (РЧВ)</strong> находят активное применение в самых различных сферах. В своей деятельности их используют строительные компании и промышленные предприятия. РЧВ могут быть задействованы в процессе прокладки шахт, бурения скважин и во время крупных экспедиций. Они жизненно необходимы в тех местах, где есть сложности с доставкой питьевой воды, но наряду с этим имеется острая необходимость в ней. Такие резервуары могут быть созданы на объектах в качестве запасного источника питьевой воды, которую используют работающие там люди.</p>\n' +
                        '<p><strong>Резервуары для хранения питьевой воды</strong> могут использоваться предприятиями, занятыми в самых различных сферах. В особенной степени характерную потребность испытывают компании, связанные с добычей газа и нефти, а также горнодобывающие объекты. Чаще всего именно такие предприятия остро нуждаются в питьевой воде, систематическая доставка которой в их адрес практически невозможна. В силу ряда причин, как правило, нет возможности обустроить и соответствующие коммуникации. Именно резервуары для хранения воды становятся спасением в таких ситуациях.</p>\n' +
                        '<p>Наряду с газо- и нефтедобывающей промышленностью, <strong>резервуары для хранения питьевой воды</strong> широко востребованы и в нефтехимической отрасли. Здесь они функционально могут являться как основным источником, обеспечивающим потребности работающего персонала в питьевой воде, так и быть востребованными лишь в случае аварийных ситуаций. Все промышленные объекты, расположенные вдалеке от магистральных систем водоснабжения, остро нуждаются в чистой питьевой воде.</p>\n',
                        link:''
                    }
                ]
            }
        },
        methods: {
            back(title, dsc, link) {
                this.$vuetify.goTo(0);
                console.log(link);
                if (dsc) {
                    this.$router.push({name: 'post', params: {title: title, dsc, link: link}});
                    // this.$router.push({path: 'post/'+c, props: {src, c, dsc}});
                    // this.$router.push({path: '/post/'+c+'/'+dsc, component: More,  query: { plan: 'private' }});
                } else if (link) {
                    this.$router.push({name: link});
                } else {
                    // this.$router.push({name: 'home'});
                }
                // if(v!='') {
                //     // var pdf = location.protocol + "//" + location.host+'/static/' + v;
                //     // window.open(pdf);
                // }
            }
        }
    }
</script>

<style scoped>

</style>