<template>
  <v-app id="inspire" dark>
    <v-navigation-drawer
            v-model="drawer"
            color="grey"
            clipped
            app
    >
      <v-list dense>
        <template v-for="(service, index) in services">
          <v-menu open-on-hover right offset-x>
          <v-list-tile slot="activator" @click="">
            <v-list-tile-action>
              <v-icon>{{service.icon}}</v-icon>
            </v-list-tile-action>
            <v-list-tile-content>
              <v-list-tile-title>{{service.name}}</v-list-tile-title>
            </v-list-tile-content>
          </v-list-tile>

            <v-list v-if="service.items">
              <v-list-tile
                      v-for="(item, index) in service.items"
                      :key="index"
                      @click="back(item.avatar, item.title, item.dsc)"
              >
                <v-list-tile-avatar>
                  <img :src="item.avatar">
                </v-list-tile-avatar>
                <v-list-tile-title>{{ item.title }}</v-list-tile-title>
              </v-list-tile>
            </v-list>
          </v-menu>
        </template>
      </v-list>
    </v-navigation-drawer>
    <v-toolbar app fixed clipped-left dark>
      <v-toolbar-side-icon color="orange" @click.stop="drawer = !drawer"></v-toolbar-side-icon>
      <v-toolbar-title class="orange--text">Сибтрейд</v-toolbar-title>
        <v-spacer></v-spacer>
        <v-toolbar-items class="hidden-sm-and-down">
            <v-btn
                    v-for="link in links"
                    :key="link"
                    color="orange"
                    @click="back()"
                    flat
                    round
            >
                {{ link }}
            </v-btn>
        </v-toolbar-items>
    </v-toolbar>
 <!--<Main></Main>-->
    <v-content>
      <router-view></router-view>
    </v-content>
      <my-footer/>
      <!--<v-footer app fixed>-->
          <!--<span>&copy; 2017</span>-->
        <!--</v-footer>-->
  </v-app>
</template>

<script>
    import Carousels from "./components/carousels";
    import ThisSibstroy from "./components/ThisSibstroy";
    import YundexMap from "./components/YundexMap";
    import ItemGroups from "./components/ItemGroups";
    import AboutUs from "./components/AboutUs";
    import Footer from "./components/Footer";
    import MyFooter from "./components/MyFooter";
    import News from "./components/News";
    import Projects from "./components/Projects";
    export default {
        components: {Projects, News, MyFooter, Footer, AboutUs, ItemGroups, YundexMap, ThisSibstroy, Carousels},
        data: () => ({
            drawer: false,
            services: [
                {name:"Водоснабжение",
                    icon: "invert_colors",
                    items: [
                        {
                            title: 'Трубы из ПЭ 80, ПЭ 100, ПЭ 100+',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_water.jpg',
                            dsc: 'Водопроводные трубы из ПНД – надёжная и экономичная альтернатива стали и железобетону\n' +
                                '\n' +
                                'Полиэтиленовые трубы под воду зарекомендовали себя как лучшие не только по техническим характеристикам, но и по результатам практического применения.\n' +
                                '\n' +
                                'Изготавливаемые из полиэтилена трубных марок высокой прочности ПЭ80 и ПЭ100, эти изделия:\n' +
                                '\n' +
                                '- хорошо выдерживают напорное давление до 16 атмосфер;\n' +
                                '- сохраняют высокую пропускную способность на долгие годы, не обрастая изнутри отложениями;\n' +
                                '- не разрушаются под действием коррозии и химически агрессивных факторов;\n' +
                                '- на замерзание воды внутри трубопровода реагируют небольшим растяжением без разрывов и повреждений;\n' +
                                '- имеют существенную пластичность, позволяя производить прокладку с поворотами и изгибами, а также с использованием современного метода прокладки – ГНБ (горизонтально-направленного бурения);\n' +
                                '- более просты в монтаже, а именно в отношении требований к персоналу, способу сварки водопровода с фитингами и элементами сети, методов контроля сварки;\n' +
                                '\n' +
                                'По многим характеристикам трубопроводы и фитинги из ПНД обходят аналоги из стали и других материалов.\n' +
                                'Трубы для водоснабжения от ООО «Техстрой»: стандарты качества\n' +
                                '\n' +
                                'Водопроводные трубы для водоснабжения, которые выпускает «Техстрой», соответствуют ГОСТ 18599-2001 – стандарту, регламентирующему характеристики и свойства. Продукция, которая подходит для питьевых систем, в обязательном порядке маркируется нанесением синих полос.'
                        },
                        {
                            title: 'Многослойные трубы МУЛЬТИТЕХ',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/Mcline_water.jpg',
                            dsc: 'Завод "ТЕХСТРОЙ" производит многослойные трубы «МультиТех» с соэкструзионными слоями диаметром 110-400 мм (*запланирован пуск в 2019 г. до 800 мм.). Мы предлагаем двухслойные трубы МультиТех II и трёхслойные трубы МультиТех III. Сырьё, из которого изготовляются трубы, это композиции полиэтилена ПЭ100 и ПЭ100RC (устойчивого к образованию и распространению трещин полиэтилена PE100RC (Resistance to Crack)). \n' +
                                'Трубы соответствуют требованиям ГОСТ 18599. \n' +
                                'Трубы изготавливаются следующих типов: \n' +
                                '\n' +
                                '    Труба многослойная с соэкструзионными слоями из РЕ100 с чёрным светостабилизирующим слоем и с белым внутренним слоем из неокрашенного полиэтилена PE100 - МультиТех Эко II; \n' +
                                '    Труба многослойная с соэкструзионными тремя слоями: наружный и внутренний слой из PE100 чёрного цвета, средний слой PE100 белый – МультиТех Эко III; \n' +
                                '    Труба двухслойная, изготавливаемая методом соэкструзии, с геометрическими размерами по ГОСТ 18599. Внутренний слой изготавливается из полиэтилена PE-100, а наружный слой – из полиэтилена PE100RC - МультиТех II (для транспортировки воды наружный цвет синий, для транспортировки газа – жёлтый); \n' +
                                '    Трёхслойная труба с соэкструзионными слоями: внутренний изготовлен из полиэтилена PE100RC, средний слой – из полиэтилена чёрного цвета PE-100, а наружный слой – из полиэтилена PE100RC - «МультиТех» III (для транспортировки воды наружный цвет синий, для газа - жёлтый). \n' +
                                '\n' +
                                'Многослойные трубы «МультиТех» предназначены для использования в строительстве подземных напорных трубопроводов, обеспечивающих хозяйственно-питьевое водоснабжение, а также для транспортировки газообразных веществ при температуре от 0 до +40°С. При этом возможно проведение укладки труб всех трёх типов с обратной засыпкой любым видом грунта, кроме валунного, с предварительным уплотнением дна траншеи. Трубы многослойные с содержанием слоя полиэтилена PE100RC с защитной оболочкой PROSAFE рекомендуются для использования при прокладке и реконструкции трубопроводов методами бестраншейных технологий (горизонтально-направленное бурение, релайнинг, замена изношенного трубопровода с его разрушением и т.п.).'},
                        { title: 'Трубы с защитной оболочкой PROSAFE',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/protect_water.jpg',
                            link: 'Truba_voda_PE100_prosafe.pdf',
                        dsc: 'Компания «Техстрой» предлагает качественные трубы ПНД PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.\n' +
                            '\n' +
                            'PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 18599-2001 (изменения 1, 2), ГОСТ Р 50838-2009, ТУ 2248-012-54432486-2013 и PAS 1075. Используется для укладки трубопроводов бестраншейным методом.\n' +
                            'Полипропиленовое покрытие труб защищает от повреждений\n' +
                            '\n' +
                            'Защитная оболочка для полиэтиленовых труб из минералонаполненного полипропилена толщиной около 2 мм является уникальной разработкой технологов предприятия «Техстрой». Она обеспечивает повышенную устойчивость трубопровода к механическим повреждениям и позволяет выполнять укладку бестраншейным методом, что экономит затраты на строительство.\n' +
                            '\n' +
                            'При укладке бестраншейным способом трубопровод может повреждаться камнями или осколками. Это повышает риск глубинного разрыва и протечки в дальнейшем.\n' +
                            '\n' +
                            'Оболочка ПЭ трубы, обладающая стойкостью к локальным нагрузкам, защищает ее от контакта с повреждающими элементами и сохраняет целостность трубопровода при любых условиях монтажа.\n' +
                            '\n' +
                            'Даже если в процессе укладки, перевозки или использования возникнут трещины и другие повреждения на защитном покрытии, они не затронут основную напорную трубу, поскольку между ней и оболочкой присутствует малое сцепление.\n' +
                            'Преимущества труб PROSAFE® с защитным покрытием\n' +
                            'Трубы PROSAFE® обладают всеми преимуществами труб из полиэтилена, при этом имеют следующие дополнительные преимущества:\n' +
                            '\n' +
                            '    Обеспечивают возможность траншейной укладки без песчаной засыпки, включая роторный метод (засыпка местным грунтом);\n' +
                            '    Позволяют безопасно применять их при горизонтально направленном бурении, проколах, релайнинге, замене с разрушением ветхого трубопровода и при использовании иных бестраншейных технологий;\n' +
                            '    Защитное покрытие значительно сглаживает пики напряжения на внутренней поверхности трубы, возникающие при воздействии неоднородностей засыпки;\n' +
                            '    Защитное покрытие обеспечивает дополнительную прочность трубы в целом относительно воздействия внутреннего давления в трубопроводе;\n' +
                            '    Увеличение срока службы трубопроводов до 100 лет;\n' +
                            '    Значительное снижение расходов на строительство трубопроводов.\n' +
                            '\n'}
                    ]},
                {
                    name:"Трубы в теплоизоляции",
                    icon: "format_color_reset",
                    dsc: 'Трубы теплоизолированные для безнапорной канализации ИЗОТЕХ для строительства сетей хозяйственно-бытовой канализации, водоотведения (безнапорной и ливневой промышленных стоков в условиях низких температур окружающей среды от 110 до 630 мм.'
                },
                {name:"Водоотведение",
                    icon: "format_color_reset",
                    items: [
                        { title: 'Система трубопроводов из НПВХ',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/Npvh_Wp.jpg',
                            dsc: 'Характеристики напорных труб\n' +
                                '\n' +
                                'Напорные трубы для водоснабжения из нПВХ подразделяются на пять типов по номинальному давлению - 0,63; 0,8; 1,0; 1,25 и 1,6 МПа.\n' +
                                '\n' +
                                'Преимущества труб из непластифицированного поливинилхлорида (НПВХ):\n' +
                                '\n' +
                                '    долговечность (срок эксплуатации 50 лет);\n' +
                                '    долговечность соединений труб друг с другом;\n' +
                                '    не подвержены адгезии;\n' +
                                '    высокая герметичность (за счет резиновых уплотнительных колец);\n' +
                                '    небольшой вес 1м трубы (облегчает транспортировку и монтаж);\n' +
                                '    химическая стойкость;\n' +
                                '    низкая шероховатость;\n' +
                                '    высокая коррозионная устойчивость;\n' +
                                '    высокая прочность (допустимое расчетное напряжение составляет 12,5 МПа);\n' +
                                '    отсутствие склонности к растрескиванию;\n' +
                                '    совершенные гидравлические свойства;\n' +
                                '    способность образовывать вместе с окружающим грунтом единую систему, способную поглощать нагрузки;\n' +
                                '    способность к самоочистке;\n' +
                                '    исключены потери напора на трение.\n' +
                                '\n' +
                                'Одним из преимуществ напорных труб для водоснабжения из нПВХ является их быстрое соединение между собой – раструбное под уплотнительное кольцо.\n' +
                                '\n' +
                                'Данное преимущество позволяет проложить данный вид труб под землей без использования дополнительного оборудования. Выпускаются в отрезках по 6 м.  '},
                        { title: 'Гофрированные трубы Техстрой"',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/Corsis_fam.jpg',
                            dsc:'Гофрированные трубы «Техстрой» из полипропилена или полиэтилена с двухслойной стенкой, изготовленные методом соэкструзии двух стенок. Продукция имеет наружный гофрированный (профилированный) слой и гладкий внутренний слой. «Техстрой» – первая компания в России, использующая инновационный метод формирования раструба, разработанный компанией IPM (Италия). Данный метод предполагает формирование раструба методом литья под давлением, т.е. без сварного шва.\n' +
                                '\n' +
                                'Производитель безнапорной двухстенной гофрированной канализационной трубы завод «Техстрой» поставляет качественную продукцию для бытовых и общественных систем канализации. Продукция от нашего предприятия обладает сертификатами соответствия и необходимыми разрешительными документами. Звоните по телефону 8 800 350 20 70, и мы поможем вам подобрать трубы гофрированные для канализации. Размеры и цены уточняйте у наших менеджеров.\n' +
                                'Двухстенная труба гофрированная ПП – преимущества использования\n' +
                                '\n' +
                                'Трубы гофрированные для безнапорной бытовой и ливневой канализации от производителя «Техстрой» обладают высокими эксплуатационными показателями и рядом других преимуществ:\n' +
                                '\n' +
                                '    монтаж осуществляется быстро и без применения спецтехники и квалифицированных кадров;\n' +
                                '    продукция обладает небольшой массой при повышенной кольцевой жёсткости (SN 12, SN 16) что снижает финансовые затраты на транспортировку и монтаж;\n' +
                                '    устойчивость к коррозии, химически агрессивным веществам, гидроабразивному изнашиванию обеспечивает целостность трубопровода в любых условиях эксплуатации;\n' +
                                '    полипропиленовые трубы для канализации (гофра) способны выдерживать температуры до 100ºС;\n' +
                                '    устойчивость к низким температурным режимам обеспечивает герметичность трубопровода даже при многоразовом замерзании жидкости;\n' +
                                '    хорошая пропускная способность обеспечивает необходимую скорость потока, благодаря чему можно не рыть глубоких уклонов;\n' +
                                '    легко соединяется как с пластиковыми, так и с железобетонными колодцами разных типов;\n' +
                                '    легко ремонтируются и быстро демонтируются;\n' +
                                '    за счёт эластичности материала защищает трубопровод от повреждений при смещении или просадке грунта;\n' +
                                '    при нормальных условиях период эксплуатации достигает 50 лет.\n' +
                                '\n' +
                                '«Техстрой» – надёжный производитель\n' +
                                '\n' +
                                'Высокое качество продукции «Техстрой» обеспечивают следующие факторы:\n' +
                                '\n' +
                                '    производство осуществляется на автоматизированном европейском оборудовании, которое гарантирует строгий контроль технологических процессов и параметров;\n' +
                                '    на предприятии работает только персонал высокой квалификации;\n' +
                                '    в качестве исходного сырья применяется продукция надёжных изготовителей;\n' +
                                '    продукция проходит многоэтапный контроль качества.\n' +
                                '\n' +
                                'Преимущества перед аналогами других производителей:\n' +
                                '\n' +
                                '    стабильность профиля гофры, обладающего высокой геометрической жёсткостью, и применение высокопрочных полимеров придаёт изделию повышенную кольцевую жёсткость в целом: SN 12, SN 16 - полипропилен;\n' +
                                '    соединительные стыки уплотняются литым кольцом из этилен-пропиленового каучука с индивидуально разработанной формой. Это гарантирует герметичность и стойкость к агрессивным средам, в том числе к нефтепродуктам;\n' +
                                '    гофрированная канализационная труба и раструбы от «Техстрой» выдерживают недолговременные повышения давления до 0,25 МПа;\n' +
                                '    благодаря уникальной конструкции монолитного с трубой раструба, который обладает удлиненной формой и специальными рёбрами жёсткости (SN 16), уменьшается риск его повреждения при транспортировке, хранении или монтаже;\n' +
                                '    завод «Техстрой» первой в РФ применила передовой способ создания раструба по итальянской технологии: когда раструб формируется на гофре методом литья под давлением. Такой метод обеспечивает высокую надёжность муфтового соединения, повышенную прочность без утолщения стенок и сохранение герметичности даже при грунтовых подвижках.\n'},
                        { title: 'Дренажные трубы Техстрой',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/fittings_1.jpg',
                            dsc: 'Заказывайте продукцию по ценам от производителя. Заполните форму, и мы свяжемся с вами в ближайшее время! Описание\n' +
                                '\n' +
                                'Дренажные гофрированные трубы «Техстрой» из полипропилена и полиэтилена, изготовленные методом соэкструзии двух стенок. Продукция имеет наружный гофрированный (профилированный) слой и гладкий внутренний слой. «Техстрой» – первая компания в России, использующая инновационный метод формирования раструба, разработанный компанией IPM (Италия). Данный метод предполагает формирование раструба методом литья под давлением, т.е. без сварного шва.\n' +
                                '\n' +
                                'Дренажные гофрированная труба ПП, производимая заводом «Техстрой», изготавливается по ТУ 2248-011-54432486- 2013. В качестве сырья используются полипропиленовые материалы, а продукция может отличаться диаметром, классом жёсткости до SN16 и типами перфорации.\n' +
                                'Дренажные трубы для отвода воды\n' +
                                '\n' +
                                'Дренаж – это искусственное удаление излишней воды либо с поверхности земли, либо из грунта. Дренаж представляет собой взаимосвязанную систему разветвлений труб, расположенную вокруг защищаемой от влаги территории.\n' +
                                '\n' +
                                'На сегодняшний день существует большой выбор дренажных систем, но их общая – цель предотвращение затопления смонтированных в землю строительных конструкций, а также защита от избыточной влаги. В современных системах часто используется дренажная гофрированная труба из ПЭ или ПП, в том числе для создания:\n' +
                                '\n' +
                                '    мелиорационных коммуникаций;\n' +
                                '    отведения ливневых стоков автомобильных и железных дорог;\n' +
                                '    отведения сточных вод на станциях и полигонах ТБО;\n' +
                                '    отведения ливневых стоков в городском строительстве;\n' +
                                '    отведения промышленных стоков предприятий.\n' +
                                '\n' +
                                '«Техстрой» производит дренажные гофрированные трубы разного класса жёсткости из полипропилена и полиэтилена, с различными типами и сложностью перфорации (См. рис. ниже). В продаже представлена продукция диаметром от d-110 мм до d-1000 мм. Все виды труб сопровождаются сертификатами соответствия и паспортами.\n' +
                                '\n' +
                                'Серийные дренажные трубы завод выпускает 6-метровыми отрезками, которые удобны для транспортировки и монтажа. Но по желанию заказчика можно изготовить трубу необходимой длины с учётом индивидуальных параметров.\n' +
                                'Технические характеристики дренажных гофрированных труб\n' +
                                '\n' +
                                'Трубы обладают повышенной степенью жёсткости в силу специфичности профиля гофры. Уплотнительное кольцо из этилен-пропиленового каучука обеспечивает стойкость к влиянию агрессивной химии и позволяет продукции сохранять свои характеристики при контакте с нефтепродуктами.\n' +
                                '\n' +
                                'За счёт уникального технологического процесса формирования раструба (литья под высоким давлением), гофрированные дренажные трубы прочно и герметично соединяются друг с другом. Раструб имеет рёбра жёсткости, которые снижают риски механических повреждений трубопровода при перевозке и укладке.\n' +
                                '\n' +
                                'Маркировка и полосы разного цвета указывают на технические параметры, назначение трубы, вид материала и степень кольцевой жёсткости.'},
                        { title: 'Спиральновитые трубы СВТ',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/perfocore.jpg',
                            dsc: 'Спиральновитые полиэтиленовые трубы производит и предлагает к поставке предприятие «Техстрой». Продукция сопровождается сертификатами соответствия и другими разрешительными документами.\n' +
                                '\n' +
                                'Звоните, если вам нужна СВТ (спиральновитая труба). Купить изделие нужного диаметра и кольцевой жёсткости помогут менеджеры нашего завода.\n' +
                                'Спиральновитая труба – производство «Техстрой»\n' +
                                '\n' +
                                'Спиральновитые трубы производитель «Техстрой» выпускает по ТУ 2248-024-54432486-2016.\n' +
                                '\n' +
                                'Труба спиральновитая полиэтиленовая производится особым методом. В процессе изготовления полый прямоугольный профиль навивается на вращающийся цилиндр, и одновременно экструдер сваривает витки профиля между собой.\n' +
                                '\n' +
                                'За счёт такой технологии производства повышается жёсткость изделия и его устойчивость к любым деформациям.\n' +
                                'Спиральновитые трубы из полиэтилена: характеристики\n' +
                                '\n' +
                                'Труба «Техстрой СВТ» обладает номинальными внутренними диаметрами в диапазоне от 1200 мм до 2600 мм. Она способна транспортировать в безнапорной системе жидкие среды температурой до +45°С, и может выдерживать непродолжительные повышения температуры до +80˚С. Эффективно применение данных изделий для реконструкции повреждённых и ветхих трубопроводных систем методом санации. При этом не требуется остановка водостоков.\n' +
                                '\n' +
                                'Длина изделий зависит от потребностей и пожеланий клиента и ограничена исключительно удобством транспортировки. От номинального значения показатель длины может отклоняться не более чем на 1%.\n' +
                                '\n' +
                                'К заказу доступны изделия с показателями жёсткости от SN2 до SN16, которые отличаются толщиной стенки.\n' +
                                'СВТ – трубы с гладкими и винтовыми окончаниями на выбор клиента \n' +
                                '\n' +
                                'На выбор заказчика «Техстрой» может произвести спиральновитые трубы под разные способы стыкования.\n' +
                                '\n' +
                                'Если предполагается использовать методы соединения с помощью муфты, бандажа с резиновым уплотнителем или экструзионного стыкования, то следует выбирать изделия с гладкими окончаниями.\n' +
                                '\n' +
                                'Если заказчик планирует свинчивать изделия между собой с последующей герметизацией стыков (только экструзией либо экструзией и термоусаживающей лентой), в этом случае подойдут спиральновитые трубы с резьбой.'}
                    ]},
                {name:"Газораспределение",
                    icon: "local_gas_station",
                    items: [
                        { title: 'Трубы из ПЭ 80, ПЭ 100; ТУ и ГОСТ',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/gost_gas.jpg',
                            dsc: 'Качество труб «Техстрой» для газопроводов обусловлено полным соответствием ГОСТ Р 50838-2009.\n' +
                                '\n' +
                                ' Обращайтесь к нам напрямую, и вас порадует выгодная цена трубы для газа.\n' +
                                'Газовая труба – надёжность как залог безопасности\n' +
                                '\n' +
                                'Полиэтиленовая труба для газа является одним из самых ответственных изделий, в производстве которого принципиально важное значение имеет строгое соблюдение технологии, применение высокопрочных качественных материалов и контроль на каждом этапе. Только при соблюдении данных факторов можно обеспечить безопасность трубопровода для людей и окружающей среды.\n' +
                                'Изготовление газовой трубы по ГОСТу\n' +
                                '\n' +
                                'Трубы для газа от производителя «Техстрой» изготавливаются в условиях завода, где применяется новейшее оборудование, осуществляется ежесекундный контроль всех технологических этапов и строго соблюдаются требования ГОСТ Р 50838-2009.\n' +
                                '\n' +
                                'Производство труб для газопроводов осуществляется с применением качественного полиэтилена марки ПЭ100, прочностные и эксплуатационные характеристики которого одобрены госстандартами для создания газовых сетей. По запросу Заказчика возможно изготовление газовых труб из ПЭ 80.\n' +
                                '\n' +
                                'Также, согласно нормам, каждая выпускаемая труба под газ получает маркировку жёлтыми полосами, что визуально демонстрирует возможность применения данных труб в сфере строительства газовых трубопроводов.\n' +
                                '\n' +
                                'Завод «Техстрой» предлагает возможность изготовления трубы ПНД для газопроводов с защитным покрытием PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.\n' +
                                '\n' +
                                'PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 50838-2009. Используется для укладки трубопроводов бестраншейным методом.\n' +
                                'Преимущества полиэтиленовых труб для газопроводов\n' +
                                '\n' +
                                '- Обладают высокими эксплуатационными характеристиками, благодаря чему являются оптимальным решением для газовых трубопроводов.\n' +
                                '\n' +
                                '- Изделия рассчитаны на 50 лет безаварийного функционирования.\n' +
                                '\n' +
                                '- Обладают полным пакетом сертификационных документов (ГазСерт), разрешений на использование в газовой сфере и, в частности, прошли аккредитацию в системе ПАО «Газпром».\n' +
                                '\n' +
                                '- Подходят для эксплуатации в промышленной и бытовой сферах, для транспортировки сырьевого или топливного газа.\n' +
                                '\n' +
                                '- Максимально допустимое рабочее давление составляет 1,2 МПа. Газообразная среда может транспортироваться при температуре до 40ºС.\n' +
                                '\n' +
                                'По желанию Заказчика мы можем произвести трубы до 110 мм. в бухтах, а также до 630 мм. в плетях по 12-13 м.\n' +
                                'Газовая труба – цена от производителя экономит финансы\n' +
                                '\n' +
                                'Стоимость труб для газопроводов ГОСТ Р 50838-2009 от производителя всегда будет выгоднее, чем у фирм-посредников. Поэтому заказывайте и приобретайте продукцию напрямую у изготовителя.\n' +
                                '\n' +
                                'Цена труб для газа складывается из нескольких составляющих. На неё влияет диаметр, длина и допустимое рабочее давление. Максимальные параметры соответственно увеличивают стоимость трубопровода. Но не все виды газопроводных систем нуждаются в максимальных показателях.\n' +
                                '\n' +
                                'Чтобы сэкономить, нужно грамотно рассчитать предполагаемую нагрузку, объём транспортируемой среды и прочие факторы, от которых зависят характеристики трубопровода. Обращайтесь, и опытные эксперты «Техстрой» помогут вам сделать грамотные расчёты.'
                        },
                        { title: 'Трубы с защитной оболочкой PROSAFE',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/mpipe_gas.jpg',
                            dsc: 'Компания «Техстрой» предлагает качественные трубы ПНД PROSAFE. Благодаря специальной защитной оболочке они подходят для бестраншейной укладки и сохраняют целостность трубопровода в любых условиях.\n' +
                                '\n' +
                                'PROSAFE – труба из ПЭ, которая предназначена для транспортировки водных и других сред (за исключением горючих газов). Производство осуществляется по ГОСТ 18599-2001 (изменения 1, 2), ГОСТ Р 50838-2009, ТУ 2248-012-54432486-2013 и PAS 1075. Используется для укладки трубопроводов бестраншейным методом.\n' +
                                'Полипропиленовое покрытие труб защищает от повреждений\n' +
                                '\n' +
                                'Защитная оболочка для полиэтиленовых труб из минералонаполненного полипропилена толщиной около 2 мм является уникальной разработкой технологов предприятия «Техстрой». Она обеспечивает повышенную устойчивость трубопровода к механическим повреждениям и позволяет выполнять укладку бестраншейным методом, что экономит затраты на строительство.\n' +
                                '\n' +
                                'При укладке бестраншейным способом трубопровод может повреждаться камнями или осколками. Это повышает риск глубинного разрыва и протечки в дальнейшем.\n' +
                                '\n' +
                                'Оболочка ПЭ трубы, обладающая стойкостью к локальным нагрузкам, защищает ее от контакта с повреждающими элементами и сохраняет целостность трубопровода при любых условиях монтажа.\n' +
                                '\n' +
                                'Даже если в процессе укладки, перевозки или использования возникнут трещины и другие повреждения на защитном покрытии, они не затронут основную напорную трубу, поскольку между ней и оболочкой присутствует малое сцепление.\n' +
                                'Преимущества труб PROSAFE® с защитным покрытием\n' +
                                'Трубы PROSAFE® обладают всеми преимуществами труб из полиэтилена, при этом имеют следующие дополнительные преимущества:\n' +
                                '\n' +
                                '    Обеспечивают возможность траншейной укладки без песчаной засыпки, включая роторный метод (засыпка местным грунтом);\n' +
                                '    Позволяют безопасно применять их при горизонтально направленном бурении, проколах, релайнинге, замене с разрушением ветхого трубопровода и при использовании иных бестраншейных технологий;\n' +
                                '    Защитное покрытие значительно сглаживает пики напряжения на внутренней поверхности трубы, возникающие при воздействии неоднородностей засыпки;\n' +
                                '    Защитное покрытие обеспечивает дополнительную прочность трубы в целом относительно воздействия внутреннего давления в трубопроводе;\n' +
                                '    Увеличение срока службы трубопроводов до 100 лет;\n' +
                                '    Значительное снижение расходов на строительство трубопроводов.\n' +
                                '\n'},
                        { title: 'ПРОТЕКТ,\n' +
                                'ПРОТЕКТ 1075',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/Protect_gas.jpg',
                            link: ''},
                        { title: 'Многослойные трубы МУЛЬТИТЕХ',
                            avatar: 'http://www.polyplastic.ru/upload/production/menu/fitingi_gaz.png',
                            dsc: 'Завод "ТЕХСТРОЙ" производит многослойные трубы «МультиТех» с соэкструзионными слоями диаметром 110-400 мм (*запланирован пуск в 2019 г. до 800 мм.). Мы предлагаем двухслойные трубы МультиТех II и трёхслойные трубы МультиТех III. Сырьё, из которого изготовляются трубы, это композиции полиэтилена ПЭ100 и ПЭ100RC (устойчивого к образованию и распространению трещин полиэтилена PE100RC (Resistance to Crack)). \n' +
                                'Трубы соответствуют требованиям ГОСТ 18599. \n' +
                                'Трубы изготавливаются следующих типов: \n' +
                                '\n' +
                                '    Труба многослойная с соэкструзионными слоями из РЕ100 с чёрным светостабилизирующим слоем и с белым внутренним слоем из неокрашенного полиэтилена PE100 - МультиТех Эко II; \n' +
                                '    Труба многослойная с соэкструзионными тремя слоями: наружный и внутренний слой из PE100 чёрного цвета, средний слой PE100 белый – МультиТех Эко III; \n' +
                                '    Труба двухслойная, изготавливаемая методом соэкструзии, с геометрическими размерами по ГОСТ 18599. Внутренний слой изготавливается из полиэтилена PE-100, а наружный слой – из полиэтилена PE100RC - МультиТех II (для транспортировки воды наружный цвет синий, для транспортировки газа – жёлтый); \n' +
                                '    Трёхслойная труба с соэкструзионными слоями: внутренний изготовлен из полиэтилена PE100RC, средний слой – из полиэтилена чёрного цвета PE-100, а наружный слой – из полиэтилена PE100RC - «МультиТех» III (для транспортировки воды наружный цвет синий, для газа - жёлтый). \n' +
                                '\n' +
                                'Многослойные трубы «МультиТех» предназначены для использования в строительстве подземных напорных трубопроводов, обеспечивающих хозяйственно-питьевое водоснабжение, а также для транспортировки газообразных веществ при температуре от 0 до +40°С. При этом возможно проведение укладки труб всех трёх типов с обратной засыпкой любым видом грунта, кроме валунного, с предварительным уплотнением дна траншеи. Трубы многослойные с содержанием слоя полиэтилена PE100RC с защитной оболочкой PROSAFE рекомендуются для использования при прокладке и реконструкции трубопроводов методами бестраншейных технологий (горизонтально-направленное бурение, релайнинг, замена изношенного трубопровода с его разрушением и т.п.).'}
                    ]},
                {name:"Кабелезащита", icon: "offline_bolt"},
                {name:"Решение для промышленности",icon: "restore_from_trash"},
                {name:"Запорно-регулирующая арматура",icon: "sync"},
                {name:"Оборудование для сварки ПЭ труб",icon: "whatshot"},
            ],
            links: [
                'Главная',
                'Продукция',
                'Услуги',
                'Производство',
                'Прайс-листы',
                'Для проектировщиков',
                'О компании',
                'Контакты'
            ]
        }),
        props: {
            source: String
        },
        methods: {
            back(src,c,dsc){
                console.log(c);
                if(dsc){
                    this.$router.replace({ name: 'post', params: {title:c, dsc} });
                    // this.$router.replace({path: 'post/'+c, props: {src, c, dsc}});
                    // this.$router.replace({path: '/post/'+c+'/'+dsc, component: More,  query: { plan: 'private' }});
                }
                else {
                    this.$router.replace({ name: 'home'});
                }
                // if(v!='') {
                //     // var pdf = location.protocol + "//" + location.host+'/static/' + v;
                //     // window.open(pdf);
                // }
            }
        }
    }
</script>
